Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: [0377] In a possible implementation, the freshness parameter includes a quantity of rejection times, and the quantity of rejection times is used to indicate a quantity of times for which resuming of the RRC connection that the apparatus attempts to perform is rejected.
de_de: [0377] Bei einer möglichen Implementierung beinhaltet der Aktualitätsparameter eine Anzahl von Ablehnungszeiten, und die Anzahl von Ablehnungszeiten wird verwendet, um anzugeben, wie oft die von der Vorrichtung versuchte Wiederaufnahme der RRC-Verbindung abgelehnt wird.

source: [0378] In a possible implementation, the processing unit 1101 is specifically configured to increase the quantity of rejection times in the context of the terminal by 1.
de_de: [0378] Bei einer möglichen Implementierung ist die Verarbeitungseinheit 1101 speziell konfiguriert, die Anzahl der Ablehnungszeiten in dem Kontext des Endgeräts um 1 zu erhöhen.

source: [0379] During implementation of another connection resume request method,
de_de: [0379] Bei der Implementierung eines weiteren Verbindungswiederaufnahmeanforderungsverfahrens

source: the receiving unit 1102 is configured to receive a context request message from a target base station, where the context request message includes a message authentication code; the message authentication code is generated based on a freshness parameter and an integrity protection key that is of a terminal, where freshness parameters used to generate message authentication codes at two consecutive times are different; and the context request message is used to request to obtain a context of the terminal;
de_de: ist die Empfangseinheit 1102 konfiguriert, eine Kontextanforderungsnachricht von einer Zielbasisstation zu empfangen, wobei die Kontextanforderungsnachricht einen Nachrichtenauthentifizierungscode beinhaltet; der Nachrichtenauthentifizierungscode auf der Grundlage eines Aktualitätsparameters und eines Integritätsschutzschlüssels des Endgeräts erzeugt wird, wobei die Aktualitätsparameter, die zur Erzeugung von Nachrichtenauthentifizierungscodes zu zwei aufeinanderfolgenden Zeitpunkten verwendet werden, verschieden sind; und die Kontextanforderungsnachricht verwendet wird, um den Erhalt eines Kontexts des Endgeräts anzufordern;

source: the processing unit 1101 is configured to check the message authentication code based on the freshness parameter and the integrity protection key that is of the source base station, and is configured to update the freshness parameter in the context of the terminal if checking the message authentication code to be successful; and
de_de: ist die Verarbeitungseinheit 1101 konfiguriert, den Nachrichtenauthentifizierungscode auf Grundlage des Aktualitätsparameters und des Integritätsschutzschlüssels der Quellbasisstation zu überprüfen, und konfiguriert, den Aktualitätsparameter in dem Kontext des Endgeräts zu aktualisieren, falls die Überprüfung des Nachrichtenauthentifizierungscodes erfolgreich ist; und

source: the sending unit 1103 is configured to send a context response message to the target base station, where the context response message includes the context of the terminal.
de_de: ist die Sendeeinheit 1103 ist konfiguriert, eine Kontextantwortnachricht an die Zielbasisstation zu senden, wobei die Kontextantwortnachricht den Kontext des Endgeräts beinhaltet.

source: [0380] In a possible implementation, the context request message further includes an indication parameter, the indication parameter is used to indicate the freshness parameter, and the freshness parameter includes a PDCP count.
de_de: [0380] Bei einer möglichen Implementierung beinhaltet die Kontextanforderungsnachricht ferner einen Anzeigeparameter, wobei der Anzeigeparameter dazu dient, den Aktualitätsparameter anzugeben, und der Aktualitätsparameter eine PDCP-Zählung beinhaltet.

source: That the processing unit 1101 updates the context of the terminal in the source base station specifically includes:
de_de: Die Tatsache, dass die Verarbeitungseinheit 1101 den Kontext des Endgeräts in der Quellbasisstation aktualisiert, beinhaltet im Einzelnen:

source: [0381] In a possible implementation, the indication parameter includes some bits of the PDCP count.
de_de: [0381] Bei einer möglichen Implementierung enthält derAnzeigeparameter einige Bits des PDCP-Zählers.

source: The processing unit 1101 is further configured to determine, based on the indication parameter, the PDCP count indicated by the indication parameter.
de_de: Die Verarbeitungseinheit 1101 ist ferner dazu konfiguriert, basierend auf dem Anzeigeparameter die durch den Anzeigeparameter angegebene PDCP-Zählung zu bestimmen.

source: [0382] In a possible implementation, the freshness parameter includes a quantity of rejection times, and the quantity of rejection times is used to indicate a quantity of times for which resuming of the RRC connection that the apparatus attempts to perform is rejected.
de_de: [0382] Bei einer möglichen Implementierung beinhaltet der Aktualitätsparameter eine Anzahl von Ablehnungszeiten, und die Anzahl von Ablehnungszeiten wird verwendet, um anzugeben, wie oft die von der Vorrichtung versuchte Wiederaufnahme der RRC-Verbindung abgelehnt wird.

source: That the processing unit 1101 is configured to update the context of the terminal in the source base station includes: resetting the quantity of rejection times in the context of the terminal to zero.
de_de: Die Tatsache, dass die Verarbeitungseinheit 1101 dazu eingerichtet ist, den Kontext des Endgeräts in der Quellbasisstation zu aktualisieren, beinhaltet: Zurücksetzen der Anzahl von Ablehnungszeiten in dem Kontext des Endgeräts auf null.

source: [0383] It should be understood that the source base station may be configured to implement the steps performed by the source base station in the methods in the embodiments of the present invention.
de_de: [0383] Es versteht sich, dass die Quellbasisstation konfiguriert sein kann, die Schritte durchzuführen, die von der Quellbasisstation in den Verfahren der Ausführungsformen der vorliegenden Erfindung durchgeführt werden.

source: [0384] All or some of the foregoing embodiments may be implemented by using software, hardware, firmware, or any combination thereof.
de_de: [0384] Alle oder einige der vorstehenden Ausführungsformen können unter Verwendung von Software, Hardware, Firmware oder einer beliebigen Kombination davon implementiert werden.

source: When software is used to implement the embodiments, the embodiments may be implemented completely or partially in a form of a computer program product.
de_de: Wenn eine Software verwendet wird, um die Ausführungsformen zu implementieren, können die Ausführungsformen komplett oder teilweise in einer Form eines Computerprogrammprodukts implementiert sein.

source: The computer program product includes one or more computer instructions.
de_de: Das Computerprogrammprodukt schließt eine oder mehrere Computeranweisungen ein.

source: When the computer instructions are loaded and executed on a computer, the procedure or functions according to the embodiments of the present invention are all or partially generated.
de_de: Wenn die Computeranweisungen auf einen Computer geladen und ausgeführt werden, werden der Ablauf oder die Funktionen gemäß den Ausführungsformen der vorliegenden Erfindung alle oder teilweise erzeugt.

source: The computer may be a general-purpose computer, a special-purpose computer, a computer network, or another programmable apparatus.
de_de: Der Computer kann ein Universalcomputer, ein Spezialcomputer, ein Computernetzwerk oder eine andere programmierbare Einrichtung sein.

source: The computer instructions may be stored in a computer-readable storage medium or may be transmitted from a computer-readable storage medium to another computer-readable storage medium.
de_de: Die Computeranweisungen können in einem computerlesbaren Speichermedium gespeichert werden oder können von einem computerlesbaren Speichermedium zu einem anderen computerlesbaren Speichermedium übertragen werden.

source: For example, the computer instructions may be transmitted from a website, computer, server, or data center to another website, computer, server, or data center in a wired (for example, a coaxial cable, an optical fiber, or a digital subscriber line (DSL)) or wireless (for example, infrared, radio, or microwave) manner.
de_de: Zum Beispiel können die Computeranweisungen von einer Website, einem Computer, einem Server oder einem Datenzentrum zu einer anderen Website, einem anderen Computer, Server oder Datenzentrum auf eine drahtgebundene (zum Beispiel ein Koaxialkabel, eine optische Faser oder eine digitale Teilnehmerleitung (DSL)) oder drahtlose (zum Beispiel Infrarot, Funk oder Mikrowelle) Weise übertragen werden.

source: The computer-readable storage medium may be any usable medium accessible by the computer, or a data storage device, such as a server or a data center, integrating one or more usable media.
de_de: Das computerlesbare Speichermedium kann ein verwendbares Medium, auf das ein Computer zugreifen kann, oder eine Datenspeichervorrichtung, wie ein Server oder ein Datenzentrum, in der ein oder mehrere nutzbare Medien integriert sind, sein.

source: The usable medium may be a magnetic medium (for example, a floppy disk, a hard disk, or a magnetic tape), an optical medium (for example, a DVD), a semiconductor medium (for example, a solid-state drive (Solid State Disk, SSD)), or the like.
de_de: Das verwendbare Medium kann ein magnetisches Medium (zum Beispiel eine Diskette, eine Festplatte oder ein Magnetband), ein optisches Medium (zum Beispiel eine DVD), ein Halbleitermedium (zum Beispiel ein Halbleiter-Laufwerk ( Solid-State Disk, SSD)) oder dergleichen sein.

source: [0385] All or some of the foregoing embodiments may be implemented by using software, hardware, firmware, or any combination thereof.
de_de: [0385] Alle oder einige der vorstehenden Ausführungsformen können unter Verwendung von Software, Hardware, Firmware oder einer beliebigen Kombination davon implementiert werden.

source: [0386] Although the present invention is described with reference to the embodiments, in a process of implementing the present invention that claims protection, a person skilled in the art may understand and implement another variation of the disclosed embodiments by viewing the accompanying drawings, disclosed content, and the accompanying claims.
de_de: [0386] Vorstehend wurde die vorliegende Erfindung zwar anhand der Ausführungsformen erläutert, jedoch ist es einem Fachmann im Rahmen der Umsetzung der vorliegenden Erfindung, für die Schutz beansprucht wird, möglich, anhand der beigefügten Zeichnungen, des offenbarten Inhalts und der beigefügten Ansprüche eine andere Variante der offenbarten Ausführungsformen zu erfassen und umzusetzen.

source: In the claims, "comprising" (comprising) does not exclude another component or another step, and "a" or "one" does not exclude a meaning of plurality.
de_de: In den Ansprüchen schließt „umfassend“ (comprising) eine andere Komponente oder einen anderen Schritt nicht aus, und „ein“ oder „eine“ schließt eine Bedeutung einer Vielzahl nicht aus.

source: A single processor or another unit may implement several functions enumerated in the claims.
de_de: Ein einzelner Prozessor oder eine andere Einheit kann mehrere Funktionen implementieren, die in den Ansprüchen aufgezählt sind.

source: Some measures are recorded in dependent claims that are different from each other, but this does not mean that these measures cannot be combined to produce a better effect.
de_de: Einige Maßnahmen sind in voneinander verschiedenen abhängigen Ansprüchen erfasst, was jedoch nicht bedeutet, dass diese Maßnahmen nicht zur Erzielung einer besseren Wirkung kombiniert werden können.

source: [0387] A person skilled in the art should understand that the embodiments of this application may be provided as a method, an apparatus (device), a computer-readable storage medium, or a computer program product.
de_de: [0387] Einem Fachmann sollte klar sein, dass die Ausführungsformen der vorliegenden Anmeldung als Verfahren, als Vorrichtung (Einrichtung), als computerlesbares Speichermedium oder als Computerprogrammprodukt bereitgestellt werden können.

source: Therefore, this application may use a form of hardware only embodiments, software only embodiments, or embodiments with a combination of software and hardware.
de_de: Daher kann diese Anwendung eine Form von Nur-Hardware-Ausführungsformen, Nur-Software-Ausführungsformen oder Ausführungsformen mit einer Kombination aus Software und Hardware verwenden.

source: They are collectively referred to as "modules" or "systems".
de_de: Sie werden zusammenfassend als „Module“ oder „Systeme“ bezeichnet.

source: [0388] A person skilled in the art may further understand that various illustrative logical blocks (illustrative logical block) and steps (step) that are listed in the embodiments of this application may be implemented by using electronic hardware, computer software, or a combination thereof.
de_de: [0388] Einem Fachmann ist ferner ersichtlich, dass verschiedene beispielhafte logische Blöcke (illustrative logical block) und Schritte (Step), die in Ausführungsformen dieser Anmeldung aufgeführt werden, unter Verwendung elektronischer Hardware, Computersoftware oder einer Kombination davon implementiert werden können.

source: Whether the functions are implemented by using hardware or software depends on particular applications and a design requirement of the entire system.
de_de: Ob die Funktionen unter Verwendung von Hardware oder Software implementiert werden, hängt von bestimmten Anwendungen und den Designanforderungen des gesamten Systems ab.

source: A person skilled in the art may use various methods to implement the described functions for each particular application, but it should not be considered that the implementation goes beyond the scope of the embodiments of this application.
de_de: Ein Fachmann kann verschiedene Verfahren verwenden, um die beschriebenen Funktionen für jede spezielle Anwendung zu implementieren, dies sollte jedoch nicht so ausgelegt werden, dass die Implementierung den Rahmen von den Ausführungsformen dieser Anmeldung verlässt.

source: [0389] Although the present invention is described with reference to specific features and the embodiments thereof, various modifications and combinations may be made to them without departing from the scope of the present invention.
de_de: [0389] Zwar wird die vorliegende Erfindung unter Bezugnahme auf konkrete Merkmale und deren Ausführungsformen beschrieben, jedoch können an diesen diverse Modifikationen und Kombinationen vorgenommen werden, ohne vom Schutzumfang der vorliegenden Erfindung abzuweichen.

source: Correspondingly, the specification and the accompanying drawings are merely examples for description of the present invention defined by the appended claims, and are considered as any of or all modifications, variations, combinations or equivalents that cover the scope of the present invention.
de_de: Dementsprechend dienen die Beschreibung und die beigefügten Zeichnungen lediglich als Beispiele zur Erläuterung der vorliegenden Erfindung, die durch die beigefügten Ansprüche definiert ist, und es wird davon ausgegangen, dass sämtliche Modifikationen, Abwandlungen, Kombinationen oder Äquivalente, die in den Schutzumfang der vorliegenden Erfindung fallen, ebenfalls als in den Schutzumfang der vorliegenden Erfindung einbezogen zu betrachten sind.

source: A person skilled in the art can make various modifications and variations to the present invention without departing from the scope of the present invention.
de_de: Ein Fachmann kann an der vorliegenden Erfindung verschiedene Modifikationen und Varianten vornehmen, ohne vom Schutzumfang der vorliegenden Erfindung abzuweichen.

source: The present invention is intended to cover these modifications and variations provided that they fall within the scope of the claims of the present invention and their equivalent technologies.
de_de: Die vorliegende Erfindung soll diese Modifikationen und Varianten umfassen, sofern sie in den Schutzumfang der Ansprüche der vorliegenden Erfindung und der diesen Ansprüchen äquivalenten Technologien fallen.

source: Source base station
de_de: Quellbasisstation

source: Target base station
de_de: Zielbasisstation

source: Terminal
de_de: Endgerät

source: Base station
de_de: Basisstation

source: 201: Determine to suspend an RRC connection of the terminal
de_de: 201: Entscheiden, die RRC-Verbindung des Endgeräts zu unterbrechen

source: 202: RRC connection release message
de_de: 202: RRC-Verbindungsfreigabenachricht

source: 203: Enter a suspend state
de_de: 203: In den Aussetzungszustand eintreten

source: 301: Generate a message authentication code
de_de: 301: Nachrichtenauthentifizierungscode erzeugen

source: 302: Connection resume request message
de_de: 302: Verbindungswiederaufnahmeanforderungsnachricht

source: 303: Whether to accept the resume request of the terminal
de_de: 303: Entscheiden, ob die Wiederaufnahmeanforderung des Endgeräts angenommen werden soll

source: 304: Connection resume rejection message
de_de: 304: Verbindungswiederaufnahmeablehnungsnachricht

source: 305: Context request message
de_de: 305: Kontextanforderungsnachricht

source: 306: Obtain a context of the terminal if the message authentication code is checked to be successful
de_de: 306: Erhalten eines Kontexts des Endgeräts, sofern die Prüfung des Nachrichtenauthentifizierungscodes als erfolgreich festgestellt wurde

source: 307: Context response message
de_de: 307: Kontextantwortnachricht

source: 308: Connection resume response message
de_de: 308: Verbindungswiederaufnahmeantwortnachricht

source: 401: Generate a message authentication code
de_de: 401: Nachrichtenauthentifizierungscode erzeugen

source: 402: Connection resume request message
de_de: 402: Verbindungswiederaufnahmeanforderungsnachricht

source: 403: Whether to accept the resume request of the terminal
de_de: 403: Entscheiden, ob die Wiederaufnahmeanforderung des Endgeräts angenommen werden soll

source: 404: Notification message
de_de: 404: Benachrichtigungsnachricht

source: 405: Update a context of the terminal if the message authentication code is checked to be successful
de_de: 405: Aktualisieren eines Kontexts des Endgeräts, sofern die Prüfung des Nachrichtenauthentifizierungscodes als erfolgreich festgestellt wird

source: 406: Response message
de_de: 406: Antwortnachricht

source: 407: Connection resume rejection message
de_de: 407: Verbindungswiederaufnahmeablehnungsnachricht

source: 408: Context request message
de_de: 408: Kontextanforderungsnachricht

source: 409: Update a freshness parameter in the context of the terminal if the message authentication code is checked to be successful
de_de: 409: Aktualisieren eines Aktualitätsparameters in dem Kontext des Endgeräts, sofern die Überprüfung des Nachrichtenauthentifizierungscodes als erfolgreich festgestellt wurde

source: 410: Context response message
de_de: 410: Kontextantwortnachricht

source: 411: Connection resume response message
de_de: 411: Verbindungswiederaufnahmeantwortnachricht

source: 501: Generate a message authentication code
de_de: 501: Nachrichtenauthentifizierungscode erzeugen

source: 502: Connection resume request message
de_de: 502: Verbindungswiederaufnahmeanforderungsnachricht

source: 503: Whether to accept the resume request of the terminal
de_de: 503: Entscheiden, ob die Wiederaufnahmeanforderung des Endgeräts angenommen werden soll

source: 504: Notification message
de_de: 504: Benachrichtigungsnachricht

source: 505: Update a key in a context of the terminal if the message authentication code is checked to be successful
de_de: 505: Aktualisieren eines Schlüssels in dem Kontext des Endgeräts, sofern die Prüfung des Nachrichtenauthentifizierungscodes als erfolgreich festgestellt wird

source: 506: Response message
de_de: 506: Antwortnachricht

source: 507: Connection resume rejection message
de_de: 507: Verbindungswiederaufnahmeablehnungsnachricht

source: 508: Context request message
de_de: 508: Kontextanforderungsnachricht

source: 509: Obtain the context of the terminal if the message authentication code is checked to be successful
de_de: 509: Erhalten des Kontexts des Endgeräts, sofern die Prüfung des Nachrichtenauthentifizierungscodes als erfolgreich festgestellt wurde

source: 510: Context response message
de_de: 510: Kontextantwortnachricht

source: 511: Connection resume response message
de_de: 511: Verbindungswiederaufnahmeantwortnachricht

source: 601: Generate a message authentication code
de_de: 601: Nachrichtenauthentifizierungscode erzeugen

source: 602: Connection resume request message
de_de: 602: Verbindungswiederaufnahmeanforderungsnachricht

source: 603: Whether to accept the resume request of the terminal
de_de: 603: Entscheiden, ob die Wiederaufnahmeanforderung des Endgeräts angenommen werden soll

source: 604: Notification message
de_de: 604: Benachrichtigungsnachricht

source: 605: Update a freshness parameter and a key that are in a context of the terminal if the message authentication code is checked to be successful
de_de: 605: Aktualisieren eines Aktualitätsparameters und eines Schlüssels in einem Kontext des Endgeräts, sofern die Überprüfung des Nachrichtenauthentifizierungscodes als erfolgreich festgestellt wurde

source: 606: Response message
de_de: 606: Antwortnachricht

source: 607: Connection resume rejection message
de_de: 607: Verbindungswiederaufnahmeablehnungsnachricht

source: 608: Context request message
de_de: 608: Kontextanforderungsnachricht

source: 609: Update the freshness parameter and the key that are in the context of the terminal if the message authentication code is checked to be successful
de_de: 609: Aktualisieren des Aktualitätsparameters und des Schlüssels in dem Kontext des Endgeräts, sofern die Überprüfung des Nachrichtenauthentifizierungscodes als erfolgreich festgestellt wurde

source: 610: Context response message
de_de: 610: Kontextantwortnachricht

source: 611: Connection resume response message
de_de: 611: Verbindungswiederaufnahmeantwortnachricht

source: 701: Generate a message authentication code
de_de: 701: Nachrichtenauthentifizierungscode erzeugen

source: 702: Connection resume request message
de_de: 702: Verbindungswiederaufnahmeanforderungsnachricht

source: 703: Whether to accept the resume request of the terminal
de_de: 703: Entscheiden, ob die Wiederaufnahmeanforderung des Endgeräts angenommen werden soll

source: 704: Connection resume rejection message
de_de: 704: Verbindungswiederaufnahmeablehnungsnachricht

source: 705: Resume an access stratum key of the terminal to an access stratum key before update
de_de: 705: Wiederaufnehmen eines Zugriffsschichtschlüssels des Endgeräts auf einen Zugriffsschichtschlüssel vor der Aktualisierung

source: 706: Context request message
de_de: 706: Kontextanforderungsnachricht

source: 707: Obtain a context of the terminal if the message authentication code is checked to be successful
de_de: 707: Erhalten eines Kontexts des Endgeräts, sofern die Prüfung des Nachrichtenauthentifizierungscodes als erfolgreich festgestellt wurde

source: 708: Context response message
de_de: 708: Kontextantwortnachricht

source: 709: Connection resume response message
de_de: 709: Verbindungswiederaufnahmeantwortnachricht

source: Processor
de_de: Prozessor

source: Memory
de_de: Speicher

source: Transmitter
de_de: Sender

source: Receiver
de_de: Empfänger

source: Receiving unit
de_de: Empfangseinheit

source: Processing unit
de_de: Verarbeitungseinheit

source: Sending unit
de_de: Sendeeinheit
